# class pandas.DataFrame(data=None, index=None, columns=None, copy=None)

In [1]:
import pandas as pd

In [14]:
# 1 딕셔너리로 만들기
# index = 행, columns = 열, data = 값, 딕셔너리
data = {
    'A' : [1, 2],
    'B' : [3, 4]
}
df = pd.DataFrame(data)

# 데이터프레임 출력
print(df)
print()
# 열 라벨 출력
print(df.columns)
for i in df.columns:
    print(i)
print()
# 행 라벨 출력
print(df.index)
print([i for i in df.index])

   A  B
0  1  3
1  2  4

Index(['A', 'B'], dtype='object')
A
B

RangeIndex(start=0, stop=2, step=1)
[0, 1]

In [16]:
# 2 딕셔너리 + index(row)
data = {
    'A' : [1, 2],
    'B' : [3, 4]
}
df = pd.DataFrame(data, index = ['row1', 'row2'])
print(df)

      A  B
row1  1  3
row2  2  4

In [19]:
# 3 리스트
data = [[1,2,3],
        [4,5,6],
        [7,8,9]]
df = pd.DataFrame(data)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
# 4 리스트 + columns
df = pd.DataFrame(data, columns = ['첫번째', '두번째', '세번째'])
df

   첫번째  두번째  세번째
0    1    2    3
1    4    5    6
2    7    8    9

## 테이블 추가(수정), 삭제

In [21]:
# 열 추가 (딕셔너리 키 밸류 추가하듯이 추가)
df['네번째'] = [10,20,30]
df
# 열 수정
df['네번째'] = [10,10,10]
df

   첫번째  두번째  세번째  네번째
0    1    2    3   10
1    4    5    6   10
2    7    8    9   10

In [22]:
# 열 추가 + 인덱스로 추가
df.insert(1, '첫번째 두번째 사이', [4,4,4])
df

   첫번째  첫번째 두번째 사이  두번째  세번째  네번째
0    1           4    2    3   10
1    4           4    5    6   10
2    7           4    8    9   10

In [24]:
# 행 추가 (concat)
data = pd.DataFrame([1,2,3,4,5])
df = pd.concat([df, data], axis = )
df

   첫번째  첫번째 두번째 사이  두번째  세번째   네번째    0  0
0  1.0         4.0  2.0  3.0  10.0  NaN  1
1  4.0         4.0  5.0  6.0  10.0  NaN  2
2  7.0         4.0  8.0  9.0  10.0  NaN  3
0  NaN         NaN  NaN  NaN   NaN  1.0  1
1  NaN         NaN  NaN  NaN   NaN  2.0  2
2  NaN         NaN  NaN  NaN   NaN  3.0  3
3  NaN         NaN  NaN  NaN   NaN  4.0  4
4  NaN         NaN  NaN  NaN   NaN  5.0  5

## 조회

In [37]:
#2행 3열
d = df.iloc[1,2]
d
# 2행 전체열
df.iloc[1]
# 전체행 3열
df.iloc[:,2]
# 2행 3행 전체열
df.iloc[[1,2]]
# (2, 3행) 4열
df.iloc[[1,2],3]

1    6.0
2    9.0
Name: 세번째, dtype: float64

In [32]:
# 행이름 열이름
d = df.loc[:,'첫번째']
d

0    1.0
1    4.0
2    7.0
0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: 첫번째, dtype: float64